## Plan Result (stg-cftapps_cluster_lb_backend)




<pre><code>Plan: 0 to add, 3 to change, 0 to destroy.</code></pre>

* Update
  * module.app-gw.azurerm_application_gateway.ag[1]
  * module.app-gw.azurerm_monitor_diagnostic_setting.diagnostic_settings[0]
  * module.app-gw.azurerm_monitor_diagnostic_setting.diagnostic_settings[1]




<details><summary>Change Result (Click me)</summary>

```hcl

  # module.app-gw.data.azurerm_monitor_diagnostic_categories.diagnostic_categories will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "azurerm_monitor_diagnostic_categories" "diagnostic_categories" {
      + id          = (known after apply)
      + logs        = (known after apply)
      + metrics     = (known after apply)
      + resource_id = "/subscriptions/96c274ce-846d-4e48-89a7-d528432298a7/resourceGroups/cft-aat-network-rg/providers/Microsoft.Network/applicationGateways/aks00-aat-agw"

      + timeouts {
          + read = (known after apply)
        }
    }

  # module.app-gw.azurerm_application_gateway.ag[1] will be updated in-place
  ~ resource "azurerm_application_gateway" "ag" {
        id                  = "/subscriptions/96c274ce-846d-4e48-89a7-d528432298a7/resourceGroups/cft-aat-network-rg/providers/Microsoft.Network/applicationGateways/aks01-aat-agw"
        name                = "aks01-aat-agw"
        tags                = {
            "application"  = "core"
            "builtFrom"    = "hmcts/azure-platform-terraform"
            "businessArea" = "CFT"
            "criticality"  = "High"
            "environment"  = "staging"
        }
        # (4 unchanged attributes hidden)


      + backend_address_pool {
          + ip_addresses = [
              + "10.10.143.250",
              + "10.10.159.250",
            ]
          + name         = "ts-translation-service"
        }

      + backend_http_settings {
          + cookie_based_affinity               = "Disabled"
          + name                                = "ts-translation-service"
          + pick_host_name_from_backend_address = false
          + port                                = 80
          + probe_name                          = "ts-translation-service"
          + protocol                            = "Http"
          + request_timeout                     = 30
        }




      + http_listener {
          + frontend_ip_configuration_name = "appGwPrivateFrontendIp"
          + frontend_port_name             = "http"
          + host_name                      = "ts-translation-service-aat.service.core-compute-aat.internal"
          + name                           = "ts-translation-service"
          + protocol                       = "Http"
        }


      + probe {
          + host                                      = "ts-translation-service-aat.service.core-compute-aat.internal"
          + interval                                  = 10
          + minimum_servers                           = 0
          + name                                      = "ts-translation-service"
          + path                                      = "/health/liveness"
          + pick_host_name_from_backend_http_settings = false
          + protocol                                  = "Http"
          + timeout                                   = 15
          + unhealthy_threshold                       = 3

          + match {
              + body        = (known after apply)
              + status_code = (known after apply)
            }
        }

      - request_routing_rule {
          - backend_address_pool_id    = "/subscriptions/96c274ce-846d-4e48-89a7-d528432298a7/resourceGroups/cft-aat-network-rg/providers/Microsoft.Network/applicationGateways/aks01-aat-agw/backendAddressPools/camunda-optimize" -> null
          - backend_address_pool_name  = "camunda-optimize" -> null
          - backend_http_settings_id   = "/subscriptions/96c274ce-846d-4e48-89a7-d528432298a7/resourceGroups/cft-aat-network-rg/providers/Microsoft.Network/applicationGateways/aks01-aat-agw/backendHttpSettingsCollection/camunda-optimize" -> null
          - backend_http_settings_name = "camunda-optimize" -> null
          - http_listener_id           = "/subscriptions/96c274ce-846d-4e48-89a7-d528432298a7/resourceGroups/cft-aat-network-rg/providers/Microsoft.Network/applicationGateways/aks01-aat-agw/httpListeners/camunda-optimize" -> null
          - http_listener_name         = "camunda-optimize" -> null
          - id                         = "/subscriptions/96c274ce-846d-4e48-89a7-d528432298a7/resourceGroups/cft-aat-network-rg/providers/Microsoft.Network/applicationGateways/aks01-aat-agw/requestRoutingRules/camunda-optimize" -> null
          - name                       = "camunda-optimize" -> null
          - rule_type                  = "Basic" -> null
        }
      + request_routing_rule {
          + backend_address_pool_id    = "/subscriptions/96c274ce-846d-4e48-89a7-d528432298a7/resourceGroups/cft-aat-network-rg/providers/Microsoft.Network/applicationGateways/aks01-aat-agw/backendAddressPools/camunda-optimize"
          + backend_address_pool_name  = "camunda-optimize"
          + backend_http_settings_id   = "/subscriptions/96c274ce-846d-4e48-89a7-d528432298a7/resourceGroups/cft-aat-network-rg/providers/Microsoft.Network/applicationGateways/aks01-aat-agw/backendHttpSettingsCollection/camunda-optimize"
          + backend_http_settings_name = "camunda-optimize"
          + http_listener_id           = "/subscriptions/96c274ce-846d-4e48-89a7-d528432298a7/resourceGroups/cft-aat-network-rg/providers/Microsoft.Network/applicationGateways/aks01-aat-agw/httpListeners/camunda-optimize"
          + http_listener_name         = "camunda-optimize"
          + id                         = "/subscriptions/96c274ce-846d-4e48-89a7-d528432298a7/resourceGroups/cft-aat-network-rg/providers/Microsoft.Network/applicationGateways/aks01-aat-agw/requestRoutingRules/camunda-optimize"
          + name                       = "camunda-optimize"
          + rule_type                  = "Basic"
        }
      - request_routing_rule {
          - backend_address_pool_id    = "/subscriptions/96c274ce-846d-4e48-89a7-d528432298a7/resourceGroups/cft-aat-network-rg/providers/Microsoft.Network/applicationGateways/aks01-aat-agw/backendAddressPools/civil-camunda-camunda-staging" -> null
          - backend_address_pool_name  = "civil-camunda-camunda-staging" -> null
          - backend_http_settings_id   = "/subscriptions/96c274ce-846d-4e48-89a7-d528432298a7/resourceGroups/cft-aat-network-rg/providers/Microsoft.Network/applicationGateways/aks01-aat-agw/backendHttpSettingsCollection/civil-camunda-camunda-staging" -> null
          - backend_http_settings_name = "civil-camunda-camunda-staging" -> null
          - http_listener_id           = "/subscriptions/96c274ce-846d-4e48-89a7-d528432298a7/resourceGroups/cft-aat-network-rg/providers/Microsoft.Network/applicationGateways/aks01-aat-agw/httpListeners/civil-camunda-camunda-staging" -> null
          - http_listener_name         = "civil-camunda-camunda-staging" -> null
          - id                         = "/subscriptions/96c274ce-846d-4e48-89a7-d528432298a7/resourceGroups/cft-aat-network-rg/providers/Microsoft.Network/applicationGateways/aks01-aat-agw/requestRoutingRules/civil-camunda-camunda-staging" -> null
          - name                       = "civil-camunda-camunda-staging" -> null
          - rule_type                  = "Basic" -> null
        }
      + request_routing_rule {
          + backend_address_pool_id    = "/subscriptions/96c274ce-846d-4e48-89a7-d528432298a7/resourceGroups/cft-aat-network-rg/providers/Microsoft.Network/applicationGateways/aks01-aat-agw/backendAddressPools/civil-camunda-camunda-staging"
          + backend_address_pool_name  = "civil-camunda-camunda-staging"
          + backend_http_settings_id   = "/subscriptions/96c274ce-846d-4e48-89a7-d528432298a7/resourceGroups/cft-aat-network-rg/providers/Microsoft.Network/applicationGateways/aks01-aat-agw/backendHttpSettingsCollection/civil-camunda-camunda-staging"
          + backend_http_settings_name = "civil-camunda-camunda-staging"
          + http_listener_id           = "/subscriptions/96c274ce-846d-4e48-89a7-d528432298a7/resourceGroups/cft-aat-network-rg/providers/Microsoft.Network/applicationGateways/aks01-aat-agw/httpListeners/civil-camunda-camunda-staging"
          + http_listener_name         = "civil-camunda-camunda-staging"
          + id                         = "/subscriptions/96c274ce-846d-4e48-89a7-d528432298a7/resourceGroups/cft-aat-network-rg/providers/Microsoft.Network/applicationGateways/aks01-aat-agw/requestRoutingRules/civil-camunda-camunda-staging"
          + name                       = "civil-camunda-camunda-staging"
          + rule_type                  = "Basic"
        }
      - request_routing_rule {
          - backend_address_pool_id    = "/subscriptions/96c274ce-846d-4e48-89a7-d528432298a7/resourceGroups/cft-aat-network-rg/providers/Microsoft.Network/applicationGateways/aks01-aat-agw/backendAddressPools/civil-camunda-data-store-staging" -> null
          - backend_address_pool_name  = "civil-camunda-data-store-staging" -> null
          - backend_http_settings_id   = "/subscriptions/96c274ce-846d-4e48-89a7-d528432298a7/resourceGroups/cft-aat-network-rg/providers/Microsoft.Network/applicationGateways/aks01-aat-agw/backendHttpSettingsCollection/civil-camunda-data-store-staging" -> null
          - backend_http_settings_name = "civil-camunda-data-store-staging" -> null
          - http_listener_id           = "/subscriptions/96c274ce-846d-4e48-89a7-d528432298a7/resourceGroups/cft-aat-network-rg/providers/Microsoft.Network/applicationGateways/aks01-aat-agw/httpListeners/civil-camunda-data-store-staging" -> null
          - http_listener_name         = "civil-camunda-data-store-staging" -> null
          - id                         = "/subscriptions/96c274ce-846d-4e48-89a7-d528432298a7/resourceGroups/cft-aat-network-rg/providers/Microsoft.Network/applicationGateways/aks01-aat-agw/requestRoutingRules/civil-camunda-data-store-staging" -> null
          - name                       = "civil-camunda-data-store-staging" -> null
          - rule_type                  = "Basic" -> null
        }
      + request_routing_rule {
          + backend_address_pool_id    = "/subscriptions/96c274ce-846d-4e48-89a7-d528432298a7/resourceGroups/cft-aat-network-rg/providers/Microsoft.Network/applicationGateways/aks01-aat-agw/backendAddressPools/civil-camunda-data-store-staging"
          + backend_address_pool_name  = "civil-camunda-data-store-staging"
          + backend_http_settings_id   = "/subscriptions/96c274ce-846d-4e48-89a7-d528432298a7/resourceGroups/cft-aat-network-rg/providers/Microsoft.Network/applicationGateways/aks01-aat-agw/backendHttpSettingsCollection/civil-camunda-data-store-staging"
          + backend_http_settings_name = "civil-camunda-data-store-staging"
          + http_listener_id           = "/subscriptions/96c274ce-846d-4e48-89a7-d528432298a7/resourceGroups/cft-aat-network-rg/providers/Microsoft.Network/applicationGateways/aks01-aat-agw/httpListeners/civil-camunda-data-store-staging"
          + http_listener_name         = "civil-camunda-data-store-staging"
          + id                         = "/subscriptions/96c274ce-846d-4e48-89a7-d528432298a7/resourceGroups/cft-aat-network-rg/providers/Microsoft.Network/applicationGateways/aks01-aat-agw/requestRoutingRules/civil-camunda-data-store-staging"
          + name                       = "civil-camunda-data-store-staging"
          + rule_type                  = "Basic"
        }
      - request_routing_rule {
          - backend_address_pool_id    = "/subscriptions/96c274ce-846d-4e48-89a7-d528432298a7/resourceGroups/cft-aat-network-rg/providers/Microsoft.Network/applicationGateways/aks01-aat-agw/backendAddressPools/civil-camunda-definition-store-staging" -> null
          - backend_address_pool_name  = "civil-camunda-definition-store-staging" -> null
          - backend_http_settings_id   = "/subscriptions/96c274ce-846d-4e48-89a7-d528432298a7/resourceGroups/cft-aat-network-rg/providers/Microsoft.Network/applicationGateways/aks01-aat-agw/backendHttpSettingsCollection/civil-camunda-definition-store-staging" -> null
          - backend_http_settings_name = "civil-camunda-definition-store-staging" -> null
          - http_listener_id           = "/subscriptions/96c274ce-846d-4e48-89a7-d528432298a7/resourceGroups/cft-aat-network-rg/providers/Microsoft.Network/applicationGateways/aks01-aat-agw/httpListeners/civil-camunda-definition-store-staging" -> null
          - http_listener_name         = "civil-camunda-definition-store-staging" -> null
          - id                         = "/subscriptions/96c274ce-846d-4e48-89a7-d528432298a7/resourceGroups/cft-aat-network-rg/providers/Microsoft.Network/applicationGateways/aks01-aat-agw/requestRoutingRules/civil-camunda-definition-store-staging" -> null
          - name                       = "civil-camunda-definition-store-staging" -> null
          - rule_type                  = "Basic" -> null
        }
      + request_routing_rule {
          + backend_address_pool_id    = "/subscriptions/96c274ce-846d-4e48-89a7-d528432298a7/resourceGroups/cft-aat-network-rg/providers/Microsoft.Network/applicationGateways/aks01-aat-agw/backendAddressPools/civil-camunda-definition-store-staging"
          + backend_address_pool_name  = "civil-camunda-definition-store-staging"
          + backend_http_settings_id   = "/subscriptions/96c274ce-846d-4e48-89a7-d528432298a7/resourceGroups/cft-aat-network-rg/providers/Microsoft.Network/applicationGateways/aks01-aat-agw/backendHttpSettingsCollection/civil-camunda-definition-store-staging"
          + backend_http_settings_name = "civil-camunda-definition-store-staging"
          + http_listener_id           = "/subscriptions/96c274ce-846d-4e48-89a7-d528432298a7/resourceGroups/cft-aat-network-rg/providers/Microsoft.Network/applicationGateways/aks01-aat-agw/httpListeners/civil-camunda-definition-store-staging"
          + http_listener_name         = "civil-camunda-definition-store-staging"
          + id                         = "/subscriptions/96c274ce-846d-4e48-89a7-d528432298a7/resourceGroups/cft-aat-network-rg/providers/Microsoft.Network/applicationGateways/aks01-aat-agw/requestRoutingRules/civil-camunda-definition-store-staging"
          + name                       = "civil-camunda-definition-store-staging"
          + rule_type                  = "Basic"
        }
      - request_routing_rule {
          - backend_address_pool_id    = "/subscriptions/96c274ce-846d-4e48-89a7-d528432298a7/resourceGroups/cft-aat-network-rg/providers/Microsoft.Network/applicationGateways/aks01-aat-agw/backendAddressPools/civil-camunda-xui-staging" -> null
          - backend_address_pool_name  = "civil-camunda-xui-staging" -> null
          - backend_http_settings_id   = "/subscriptions/96c274ce-846d-4e48-89a7-d528432298a7/resourceGroups/cft-aat-network-rg/providers/Microsoft.Network/applicationGateways/aks01-aat-agw/backendHttpSettingsCollection/civil-camunda-xui-staging" -> null
          - backend_http_settings_name = "civil-camunda-xui-staging" -> null
          - http_listener_id           = "/subscriptions/96c274ce-846d-4e48-89a7-d528432298a7/resourceGroups/cft-aat-network-rg/providers/Microsoft.Network/applicationGateways/aks01-aat-agw/httpListeners/civil-camunda-xui-staging" -> null
          - http_listener_name         = "civil-camunda-xui-staging" -> null
          - id                         = "/subscriptions/96c274ce-846d-4e48-89a7-d528432298a7/resourceGroups/cft-aat-network-rg/providers/Microsoft.Network/applicationGateways/aks01-aat-agw/requestRoutingRules/civil-camunda-xui-staging" -> null
          - name                       = "civil-camunda-xui-staging" -> null
          - rule_type                  = "Basic" -> null
        }
      + request_routing_rule {
          + backend_address_pool_id    = "/subscriptions/96c274ce-846d-4e48-89a7-d528432298a7/resourceGroups/cft-aat-network-rg/providers/Microsoft.Network/applicationGateways/aks01-aat-agw/backendAddressPools/civil-camunda-xui-staging"
          + backend_address_pool_name  = "civil-camunda-xui-staging"
          + backend_http_settings_id   = "/subscriptions/96c274ce-846d-4e48-89a7-d528432298a7/resourceGroups/cft-aat-network-rg/providers/Microsoft.Network/applicationGateways/aks01-aat-agw/backendHttpSettingsCollection/civil-camunda-xui-staging"
          + backend_http_settings_name = "civil-camunda-xui-staging"
          + http_listener_id           = "/subscriptions/96c274ce-846d-4e48-89a7-d528432298a7/resourceGroups/cft-aat-network-rg/providers/Microsoft.Network/applicationGateways/aks01-aat-agw/httpListeners/civil-camunda-xui-staging"
          + http_listener_name         = "civil-camunda-xui-staging"
          + id                         = "/subscriptions/96c274ce-846d-4e48-89a7-d528432298a7/resourceGroups/cft-aat-network-rg/providers/Microsoft.Network/applicationGateways/aks01-aat-agw/requestRoutingRules/civil-camunda-xui-staging"
          + name                       = "civil-camunda-xui-staging"
          + rule_type                  = "Basic"
        }
      - request_routing_rule {
          - backend_address_pool_id    = "/subscriptions/96c274ce-846d-4e48-89a7-d528432298a7/resourceGroups/cft-aat-network-rg/providers/Microsoft.Network/applicationGateways/aks01-aat-agw/backendAddressPools/civil-ccd-camunda-staging" -> null
          - backend_address_pool_name  = "civil-ccd-camunda-staging" -> null
          - backend_http_settings_id   = "/subscriptions/96c274ce-846d-4e48-89a7-d528432298a7/resourceGroups/cft-aat-network-rg/providers/Microsoft.Network/applicationGateways/aks01-aat-agw/backendHttpSettingsCollection/civil-ccd-camunda-staging" -> null
          - backend_http_settings_name = "civil-ccd-camunda-staging" -> null
          - http_listener_id           = "/subscriptions/96c274ce-846d-4e48-89a7-d528432298a7/resourceGroups/cft-aat-network-rg/providers/Microsoft.Network/applicationGateways/aks01-aat-agw/httpListeners/civil-ccd-camunda-staging" -> null
          - http_listener_name         = "civil-ccd-camunda-staging" -> null
          - id                         = "/subscriptions/96c274ce-846d-4e48-89a7-d528432298a7/resourceGroups/cft-aat-network-rg/providers/Microsoft.Network/applicationGateways/aks01-aat-agw/requestRoutingRules/civil-ccd-camunda-staging" -> null
          - name                       = "civil-ccd-camunda-staging" -> null
          - rule_type                  = "Basic" -> null
        }
      + request_routing_rule {
          + backend_address_pool_id    = "/subscriptions/96c274ce-846d-4e48-89a7-d528432298a7/resourceGroups/cft-aat-network-rg/providers/Microsoft.Network/applicationGateways/aks01-aat-agw/backendAddressPools/civil-ccd-camunda-staging"
          + backend_address_pool_name  = "civil-ccd-camunda-staging"
          + backend_http_settings_id   = "/subscriptions/96c274ce-846d-4e48-89a7-d528432298a7/resourceGroups/cft-aat-network-rg/providers/Microsoft.Network/applicationGateways/aks01-aat-agw/backendHttpSettingsCollection/civil-ccd-camunda-staging"
          + backend_http_settings_name = "civil-ccd-camunda-staging"
          + http_listener_id           = "/subscriptions/96c274ce-846d-4e48-89a7-d528432298a7/resourceGroups/cft-aat-network-rg/providers/Microsoft.Network/applicationGateways/aks01-aat-agw/httpListeners/civil-ccd-camunda-staging"
          + http_listener_name         = "civil-ccd-camunda-staging"
          + id                         = "/subscriptions/96c274ce-846d-4e48-89a7-d528432298a7/resourceGroups/cft-aat-network-rg/providers/Microsoft.Network/applicationGateways/aks01-aat-agw/requestRoutingRules/civil-ccd-camunda-staging"
          + name                       = "civil-ccd-camunda-staging"
          + rule_type                  = "Basic"
        }
      - request_routing_rule {
          - backend_address_pool_id    = "/subscriptions/96c274ce-846d-4e48-89a7-d528432298a7/resourceGroups/cft-aat-network-rg/providers/Microsoft.Network/applicationGateways/aks01-aat-agw/backendAddressPools/civil-ccd-data-store-staging" -> null
          - backend_address_pool_name  = "civil-ccd-data-store-staging" -> null
          - backend_htt

# ...
# ... The maximum length of GitHub Comment is 65536, so the content is omitted by tfcmt.
# ...

idam-testing-support-api"
          + http_listener_id           = "/subscriptions/96c274ce-846d-4e48-89a7-d528432298a7/resourceGroups/cft-aat-network-rg/providers/Microsoft.Network/applicationGateways/aks01-aat-agw/httpListeners/idam-testing-support-api"
          + http_listener_name         = "idam-testing-support-api"
          + id                         = "/subscriptions/96c274ce-846d-4e48-89a7-d528432298a7/resourceGroups/cft-aat-network-rg/providers/Microsoft.Network/applicationGateways/aks01-aat-agw/requestRoutingRules/idam-testing-support-api"
          + name                       = "idam-testing-support-api"
          + rule_type                  = "Basic"
        }
      - request_routing_rule {
          - backend_address_pool_id    = "/subscriptions/96c274ce-846d-4e48-89a7-d528432298a7/resourceGroups/cft-aat-network-rg/providers/Microsoft.Network/applicationGateways/aks01-aat-agw/backendAddressPools/idam-user-dashboard" -> null
          - backend_address_pool_name  = "idam-user-dashboard" -> null
          - backend_http_settings_id   = "/subscriptions/96c274ce-846d-4e48-89a7-d528432298a7/resourceGroups/cft-aat-network-rg/providers/Microsoft.Network/applicationGateways/aks01-aat-agw/backendHttpSettingsCollection/idam-user-dashboard" -> null
          - backend_http_settings_name = "idam-user-dashboard" -> null
          - http_listener_id           = "/subscriptions/96c274ce-846d-4e48-89a7-d528432298a7/resourceGroups/cft-aat-network-rg/providers/Microsoft.Network/applicationGateways/aks01-aat-agw/httpListeners/idam-user-dashboard" -> null
          - http_listener_name         = "idam-user-dashboard" -> null
          - id                         = "/subscriptions/96c274ce-846d-4e48-89a7-d528432298a7/resourceGroups/cft-aat-network-rg/providers/Microsoft.Network/applicationGateways/aks01-aat-agw/requestRoutingRules/idam-user-dashboard" -> null
          - name                       = "idam-user-dashboard" -> null
          - rule_type                  = "Basic" -> null
        }
      + request_routing_rule {
          + backend_address_pool_id    = "/subscriptions/96c274ce-846d-4e48-89a7-d528432298a7/resourceGroups/cft-aat-network-rg/providers/Microsoft.Network/applicationGateways/aks01-aat-agw/backendAddressPools/idam-user-dashboard"
          + backend_address_pool_name  = "idam-user-dashboard"
          + backend_http_settings_id   = "/subscriptions/96c274ce-846d-4e48-89a7-d528432298a7/resourceGroups/cft-aat-network-rg/providers/Microsoft.Network/applicationGateways/aks01-aat-agw/backendHttpSettingsCollection/idam-user-dashboard"
          + backend_http_settings_name = "idam-user-dashboard"
          + http_listener_id           = "/subscriptions/96c274ce-846d-4e48-89a7-d528432298a7/resourceGroups/cft-aat-network-rg/providers/Microsoft.Network/applicationGateways/aks01-aat-agw/httpListeners/idam-user-dashboard"
          + http_listener_name         = "idam-user-dashboard"
          + id                         = "/subscriptions/96c274ce-846d-4e48-89a7-d528432298a7/resourceGroups/cft-aat-network-rg/providers/Microsoft.Network/applicationGateways/aks01-aat-agw/requestRoutingRules/idam-user-dashboard"
          + name                       = "idam-user-dashboard"
          + rule_type                  = "Basic"
        }
      - request_routing_rule {
          - backend_address_pool_id    = "/subscriptions/96c274ce-846d-4e48-89a7-d528432298a7/resourceGroups/cft-aat-network-rg/providers/Microsoft.Network/applicationGateways/aks01-aat-agw/backendAddressPools/prl-cos" -> null
          - backend_address_pool_name  = "prl-cos" -> null
          - backend_http_settings_id   = "/subscriptions/96c274ce-846d-4e48-89a7-d528432298a7/resourceGroups/cft-aat-network-rg/providers/Microsoft.Network/applicationGateways/aks01-aat-agw/backendHttpSettingsCollection/prl-cos" -> null
          - backend_http_settings_name = "prl-cos" -> null
          - http_listener_id           = "/subscriptions/96c274ce-846d-4e48-89a7-d528432298a7/resourceGroups/cft-aat-network-rg/providers/Microsoft.Network/applicationGateways/aks01-aat-agw/httpListeners/prl-cos" -> null
          - http_listener_name         = "prl-cos" -> null
          - id                         = "/subscriptions/96c274ce-846d-4e48-89a7-d528432298a7/resourceGroups/cft-aat-network-rg/providers/Microsoft.Network/applicationGateways/aks01-aat-agw/requestRoutingRules/prl-cos" -> null
          - name                       = "prl-cos" -> null
          - rule_type                  = "Basic" -> null
        }
      + request_routing_rule {
          + backend_address_pool_id    = "/subscriptions/96c274ce-846d-4e48-89a7-d528432298a7/resourceGroups/cft-aat-network-rg/providers/Microsoft.Network/applicationGateways/aks01-aat-agw/backendAddressPools/prl-cos"
          + backend_address_pool_name  = "prl-cos"
          + backend_http_settings_id   = "/subscriptions/96c274ce-846d-4e48-89a7-d528432298a7/resourceGroups/cft-aat-network-rg/providers/Microsoft.Network/applicationGateways/aks01-aat-agw/backendHttpSettingsCollection/prl-cos"
          + backend_http_settings_name = "prl-cos"
          + http_listener_id           = "/subscriptions/96c274ce-846d-4e48-89a7-d528432298a7/resourceGroups/cft-aat-network-rg/providers/Microsoft.Network/applicationGateways/aks01-aat-agw/httpListeners/prl-cos"
          + http_listener_name         = "prl-cos"
          + id                         = "/subscriptions/96c274ce-846d-4e48-89a7-d528432298a7/resourceGroups/cft-aat-network-rg/providers/Microsoft.Network/applicationGateways/aks01-aat-agw/requestRoutingRules/prl-cos"
          + name                       = "prl-cos"
          + rule_type                  = "Basic"
        }
      - request_routing_rule {
          - backend_address_pool_id    = "/subscriptions/96c274ce-846d-4e48-89a7-d528432298a7/resourceGroups/cft-aat-network-rg/providers/Microsoft.Network/applicationGateways/aks01-aat-agw/backendAddressPools/prl-dgs" -> null
          - backend_address_pool_name  = "prl-dgs" -> null
          - backend_http_settings_id   = "/subscriptions/96c274ce-846d-4e48-89a7-d528432298a7/resourceGroups/cft-aat-network-rg/providers/Microsoft.Network/applicationGateways/aks01-aat-agw/backendHttpSettingsCollection/prl-dgs" -> null
          - backend_http_settings_name = "prl-dgs" -> null
          - http_listener_id           = "/subscriptions/96c274ce-846d-4e48-89a7-d528432298a7/resourceGroups/cft-aat-network-rg/providers/Microsoft.Network/applicationGateways/aks01-aat-agw/httpListeners/prl-dgs" -> null
          - http_listener_name         = "prl-dgs" -> null
          - id                         = "/subscriptions/96c274ce-846d-4e48-89a7-d528432298a7/resourceGroups/cft-aat-network-rg/providers/Microsoft.Network/applicationGateways/aks01-aat-agw/requestRoutingRules/prl-dgs" -> null
          - name                       = "prl-dgs" -> null
          - rule_type                  = "Basic" -> null
        }
      + request_routing_rule {
          + backend_address_pool_id    = "/subscriptions/96c274ce-846d-4e48-89a7-d528432298a7/resourceGroups/cft-aat-network-rg/providers/Microsoft.Network/applicationGateways/aks01-aat-agw/backendAddressPools/prl-dgs"
          + backend_address_pool_name  = "prl-dgs"
          + backend_http_settings_id   = "/subscriptions/96c274ce-846d-4e48-89a7-d528432298a7/resourceGroups/cft-aat-network-rg/providers/Microsoft.Network/applicationGateways/aks01-aat-agw/backendHttpSettingsCollection/prl-dgs"
          + backend_http_settings_name = "prl-dgs"
          + http_listener_id           = "/subscriptions/96c274ce-846d-4e48-89a7-d528432298a7/resourceGroups/cft-aat-network-rg/providers/Microsoft.Network/applicationGateways/aks01-aat-agw/httpListeners/prl-dgs"
          + http_listener_name         = "prl-dgs"
          + id                         = "/subscriptions/96c274ce-846d-4e48-89a7-d528432298a7/resourceGroups/cft-aat-network-rg/providers/Microsoft.Network/applicationGateways/aks01-aat-agw/requestRoutingRules/prl-dgs"
          + name                       = "prl-dgs"
          + rule_type                  = "Basic"
        }
      - request_routing_rule {
          - backend_address_pool_id    = "/subscriptions/96c274ce-846d-4e48-89a7-d528432298a7/resourceGroups/cft-aat-network-rg/providers/Microsoft.Network/applicationGateways/aks01-aat-agw/backendAddressPools/rpts-api" -> null
          - backend_address_pool_name  = "rpts-api" -> null
          - backend_http_settings_id   = "/subscriptions/96c274ce-846d-4e48-89a7-d528432298a7/resourceGroups/cft-aat-network-rg/providers/Microsoft.Network/applicationGateways/aks01-aat-agw/backendHttpSettingsCollection/rpts-api" -> null
          - backend_http_settings_name = "rpts-api" -> null
          - http_listener_id           = "/subscriptions/96c274ce-846d-4e48-89a7-d528432298a7/resourceGroups/cft-aat-network-rg/providers/Microsoft.Network/applicationGateways/aks01-aat-agw/httpListeners/rpts-api" -> null
          - http_listener_name         = "rpts-api" -> null
          - id                         = "/subscriptions/96c274ce-846d-4e48-89a7-d528432298a7/resourceGroups/cft-aat-network-rg/providers/Microsoft.Network/applicationGateways/aks01-aat-agw/requestRoutingRules/rpts-api" -> null
          - name                       = "rpts-api" -> null
          - rule_type                  = "Basic" -> null
        }
      + request_routing_rule {
          + backend_address_pool_id    = "/subscriptions/96c274ce-846d-4e48-89a7-d528432298a7/resourceGroups/cft-aat-network-rg/providers/Microsoft.Network/applicationGateways/aks01-aat-agw/backendAddressPools/rpts-api"
          + backend_address_pool_name  = "rpts-api"
          + backend_http_settings_id   = "/subscriptions/96c274ce-846d-4e48-89a7-d528432298a7/resourceGroups/cft-aat-network-rg/providers/Microsoft.Network/applicationGateways/aks01-aat-agw/backendHttpSettingsCollection/rpts-api"
          + backend_http_settings_name = "rpts-api"
          + http_listener_id           = "/subscriptions/96c274ce-846d-4e48-89a7-d528432298a7/resourceGroups/cft-aat-network-rg/providers/Microsoft.Network/applicationGateways/aks01-aat-agw/httpListeners/rpts-api"
          + http_listener_name         = "rpts-api"
          + id                         = "/subscriptions/96c274ce-846d-4e48-89a7-d528432298a7/resourceGroups/cft-aat-network-rg/providers/Microsoft.Network/applicationGateways/aks01-aat-agw/requestRoutingRules/rpts-api"
          + name                       = "rpts-api"
          + rule_type                  = "Basic"
        }
      - request_routing_rule {
          - backend_address_pool_id    = "/subscriptions/96c274ce-846d-4e48-89a7-d528432298a7/resourceGroups/cft-aat-network-rg/providers/Microsoft.Network/applicationGateways/aks01-aat-agw/backendAddressPools/wa-case-event-handler" -> null
          - backend_address_pool_name  = "wa-case-event-handler" -> null
          - backend_http_settings_id   = "/subscriptions/96c274ce-846d-4e48-89a7-d528432298a7/resourceGroups/cft-aat-network-rg/providers/Microsoft.Network/applicationGateways/aks01-aat-agw/backendHttpSettingsCollection/wa-case-event-handler" -> null
          - backend_http_settings_name = "wa-case-event-handler" -> null
          - http_listener_id           = "/subscriptions/96c274ce-846d-4e48-89a7-d528432298a7/resourceGroups/cft-aat-network-rg/providers/Microsoft.Network/applicationGateways/aks01-aat-agw/httpListeners/wa-case-event-handler" -> null
          - http_listener_name         = "wa-case-event-handler" -> null
          - id                         = "/subscriptions/96c274ce-846d-4e48-89a7-d528432298a7/resourceGroups/cft-aat-network-rg/providers/Microsoft.Network/applicationGateways/aks01-aat-agw/requestRoutingRules/wa-case-event-handler" -> null
          - name                       = "wa-case-event-handler" -> null
          - rule_type                  = "Basic" -> null
        }
      + request_routing_rule {
          + backend_address_pool_id    = "/subscriptions/96c274ce-846d-4e48-89a7-d528432298a7/resourceGroups/cft-aat-network-rg/providers/Microsoft.Network/applicationGateways/aks01-aat-agw/backendAddressPools/wa-case-event-handler"
          + backend_address_pool_name  = "wa-case-event-handler"
          + backend_http_settings_id   = "/subscriptions/96c274ce-846d-4e48-89a7-d528432298a7/resourceGroups/cft-aat-network-rg/providers/Microsoft.Network/applicationGateways/aks01-aat-agw/backendHttpSettingsCollection/wa-case-event-handler"
          + backend_http_settings_name = "wa-case-event-handler"
          + http_listener_id           = "/subscriptions/96c274ce-846d-4e48-89a7-d528432298a7/resourceGroups/cft-aat-network-rg/providers/Microsoft.Network/applicationGateways/aks01-aat-agw/httpListeners/wa-case-event-handler"
          + http_listener_name         = "wa-case-event-handler"
          + id                         = "/subscriptions/96c274ce-846d-4e48-89a7-d528432298a7/resourceGroups/cft-aat-network-rg/providers/Microsoft.Network/applicationGateways/aks01-aat-agw/requestRoutingRules/wa-case-event-handler"
          + name                       = "wa-case-event-handler"
          + rule_type                  = "Basic"
        }
      - request_routing_rule {
          - backend_address_pool_id    = "/subscriptions/96c274ce-846d-4e48-89a7-d528432298a7/resourceGroups/cft-aat-network-rg/providers/Microsoft.Network/applicationGateways/aks01-aat-agw/backendAddressPools/wa-task-monitor" -> null
          - backend_address_pool_name  = "wa-task-monitor" -> null
          - backend_http_settings_id   = "/subscriptions/96c274ce-846d-4e48-89a7-d528432298a7/resourceGroups/cft-aat-network-rg/providers/Microsoft.Network/applicationGateways/aks01-aat-agw/backendHttpSettingsCollection/wa-task-monitor" -> null
          - backend_http_settings_name = "wa-task-monitor" -> null
          - http_listener_id           = "/subscriptions/96c274ce-846d-4e48-89a7-d528432298a7/resourceGroups/cft-aat-network-rg/providers/Microsoft.Network/applicationGateways/aks01-aat-agw/httpListeners/wa-task-monitor" -> null
          - http_listener_name         = "wa-task-monitor" -> null
          - id                         = "/subscriptions/96c274ce-846d-4e48-89a7-d528432298a7/resourceGroups/cft-aat-network-rg/providers/Microsoft.Network/applicationGateways/aks01-aat-agw/requestRoutingRules/wa-task-monitor" -> null
          - name                       = "wa-task-monitor" -> null
          - rule_type                  = "Basic" -> null
        }
      + request_routing_rule {
          + backend_address_pool_id    = "/subscriptions/96c274ce-846d-4e48-89a7-d528432298a7/resourceGroups/cft-aat-network-rg/providers/Microsoft.Network/applicationGateways/aks01-aat-agw/backendAddressPools/wa-task-monitor"
          + backend_address_pool_name  = "wa-task-monitor"
          + backend_http_settings_id   = "/subscriptions/96c274ce-846d-4e48-89a7-d528432298a7/resourceGroups/cft-aat-network-rg/providers/Microsoft.Network/applicationGateways/aks01-aat-agw/backendHttpSettingsCollection/wa-task-monitor"
          + backend_http_settings_name = "wa-task-monitor"
          + http_listener_id           = "/subscriptions/96c274ce-846d-4e48-89a7-d528432298a7/resourceGroups/cft-aat-network-rg/providers/Microsoft.Network/applicationGateways/aks01-aat-agw/httpListeners/wa-task-monitor"
          + http_listener_name         = "wa-task-monitor"
          + id                         = "/subscriptions/96c274ce-846d-4e48-89a7-d528432298a7/resourceGroups/cft-aat-network-rg/providers/Microsoft.Network/applicationGateways/aks01-aat-agw/requestRoutingRules/wa-task-monitor"
          + name                       = "wa-task-monitor"
          + rule_type                  = "Basic"
        }
      + request_routing_rule {
          + backend_address_pool_id    = (known after apply)
          + backend_address_pool_name  = "ts-translation-service"
          + backend_http_settings_id   = (known after apply)
          + backend_http_settings_name = "ts-translation-service"
          + http_listener_id           = (known after apply)
          + http_listener_name         = "ts-translation-service"
          + id                         = (known after apply)
          + name                       = "ts-translation-service"
          + redirect_configuration_id  = (known after apply)
          + rewrite_rule_set_id        = (known after apply)
          + rule_type                  = "Basic"
          + url_path_map_id            = (known after apply)
        }



        # (182 unchanged blocks hidden)
    }

  # module.app-gw.azurerm_monitor_diagnostic_setting.diagnostic_settings[0] will be updated in-place
  ~ resource "azurerm_monitor_diagnostic_setting" "diagnostic_settings" {
        id                         = "/subscriptions/96c274ce-846d-4e48-89a7-d528432298a7/resourceGroups/cft-aat-network-rg/providers/Microsoft.Network/applicationGateways/aks00-aat-agw|AppGw"
        name                       = "AppGw"
        # (2 unchanged attributes hidden)

      - log {
          - category = "ApplicationGatewayAccessLog" -> null
          - enabled  = true -> null

          - retention_policy {
              - days    = 0 -> null
              - enabled = false -> null
            }
        }
      - log {
          - category = "ApplicationGatewayFirewallLog" -> null
          - enabled  = true -> null

          - retention_policy {
              - days    = 0 -> null
              - enabled = false -> null
            }
        }
      - log {
          - category = "ApplicationGatewayPerformanceLog" -> null
          - enabled  = false -> null

          - retention_policy {
              - days    = 0 -> null
              - enabled = false -> null
            }
        }

      - metric {
          - category = "AllMetrics" -> null
          - enabled  = true -> null

          - retention_policy {
              - days    = 0 -> null
              - enabled = true -> null
            }
        }
      + metric {
          + category = (known after apply)
          + enabled  = (known after apply)

          + retention_policy {
              + days    = (known after apply)
              + enabled = (known after apply)
            }
        }
    }

  # module.app-gw.azurerm_monitor_diagnostic_setting.diagnostic_settings[1] will be updated in-place
  ~ resource "azurerm_monitor_diagnostic_setting" "diagnostic_settings" {
        id                         = "/subscriptions/96c274ce-846d-4e48-89a7-d528432298a7/resourceGroups/cft-aat-network-rg/providers/Microsoft.Network/applicationGateways/aks01-aat-agw|AppGw"
        name                       = "AppGw"
        # (2 unchanged attributes hidden)

      - log {
          - category = "ApplicationGatewayAccessLog" -> null
          - enabled  = true -> null

          - retention_policy {
              - days    = 0 -> null
              - enabled = false -> null
            }
        }
      - log {
          - category = "ApplicationGatewayFirewallLog" -> null
          - enabled  = true -> null

          - retention_policy {
              - days    = 0 -> null
              - enabled = false -> null
            }
        }
      - log {
          - category = "ApplicationGatewayPerformanceLog" -> null
          - enabled  = false -> null

          - retention_policy {
              - days    = 0 -> null
              - enabled = false -> null
            }
        }

      - metric {
          - category = "AllMetrics" -> null
          - enabled  = true -> null

          - retention_policy {
              - days    = 0 -> null
              - enabled = true -> null
            }
        }
      + metric {
          + category = (known after apply)
          + enabled  = (known after apply)

          + retention_policy {
              + days    = (known after apply)
              + enabled = (known after apply)
            }
        }
    }

Plan: 0 to add, 3 to change, 0 to destroy.
```

</details>





<!-- github-comment: {"Command":"plan","PRNumber":1220,"Program":"tfcmt","SHA1":"","Target":"stg-cftapps_cluster_lb_backend","Vars":{}} -->